AccumulationRegisters/Лео_Скидки/Лео_Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Лео_Скидки</name>
  <comment>Скидки (Упр)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументСкидки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолучательСкидки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловиеСкидки</name>
    <type>
      <types>EnumRef.УсловияСкидкиНаценки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Скидка</name>
    <type>
      <types>DocumentRef.УстановкаСкидокНоменклатуры</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСкидкиНаценки</name>
    <type>
      <types>CatalogRef.ТипыСкидокНаценок</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Enums/УсловияСкидкиНаценки/УсловияСкидкиНаценки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияСкидкиНаценки</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>ПоВидуОплаты</name>
  </enumValues>
  <enumValues>
    <name>ПоДисконтнойКарте</name>
  </enumValues>
  <enumValues>
    <name>ПоКоличествуТовара</name>
  </enumValues>
  <enumValues>
    <name>ПоСуммеДокумента</name>
  </enumValues>
  <enumValues>
    <name>РучнаяСкидка</name>
  </enumValues>
  <enumValues>
    <name>БезУсловий</name>
    <comment>Скидка (наценка) процентом</comment>
  </enumValues>
  <enumValues>
    <name>СпецПредложение</name>
  </enumValues>
  <enumValues>
    <name>ПоВидуДисконтныхКарт</name>
  </enumValues>
  <enumValues>
    <name>абс_СуммойНаДокумент</name>
    <comment>Скидка (наценка) суммой на документ</comment>
  </enumValues>
  <enumValues>
    <name>абс_Количеством</name>
    <comment>Скидка количеством</comment>
  </enumValues>
  <enumValues>
    <name>абс_СпециальнаяЦена</name>
    <comment>Специальная цена</comment>
  </enumValues>
  <enumValues>
    <name>абс_ПроцентомСОграничением</name>
  </enumValues>
</mdclass:Enum>

Documents/УстановкаСкидокНоменклатуры/УстановкаСкидокНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидокНоменклатуры</name>
  <comment>(Упр)</comment>
  <basedOn>Document.Лео_ЗаявкаНаАкцию</basedOn>
  <registerRecords>InformationRegister.СкидкиНаценкиНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.абс_СкидкиНаценки</registerRecords>
  <registerRecords>InformationRegister.СкидкиНоменклатурыНатуральные</registerRecords>
  <registerRecords>InformationRegister.СкидкиНаценкиПоЦеновымГруппам</registerRecords>
  <registerRecords>InformationRegister.ВремяДействияСкидок</registerRecords>
  <registerRecords>InformationRegister.СпецПредложения</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидки</name>
    <type>
      <types>EnumRef.ВидыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсейНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляВсехПолучателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеУсловия</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
      <types>Number</types>
      <types>CatalogRef.ВидыОплатЧекаККМ</types>
      <types>CatalogRef.ИнформационныеКарты</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСкидкиНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидкиНаценки</name>
    <type>
      <types>CatalogRef.ТипыСкидокНаценок</types>
    </type>
  </attributes>
  <attributes>
    <name>Условие</name>
    <type>
      <types>EnumRef.УсловияСкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДнямНедели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийУстановкаСкидокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_УсловиеДляСкидкиКоличеством</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_СкидкаКоличеством</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_СкидкаСуммой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПрименятьСкидкуДоОграничения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаНачалаНакопления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_НазначаетсяВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ТипАкции</name>
    <type>
      <types>CatalogRef.Лео_ТипАкции</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СтатьяОборотовПоБюджету</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_НомерАктивности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ДокументОснование</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ОграничениеСкидкиНаценки</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лео_ЛимитШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лео_ЛимитСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лео_Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкидки</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВремяПоДнямНедели</name>
    <comment>(Общ) Время действия скидки</comment>
    <attributes>
      <name>Выбран</name>
      <comment>(Общ) Признак выбранного дня недели</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <comment>(Общ) День недели</comment>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <comment>(Общ) Время начала действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <comment>(Общ) Время окончания действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеновыеГруппы</name>
    <attributes>
      <name>ЦеноваяГруппа</name>
      <type>
        <types>CatalogRef.ЦеновыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОграничениеСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бонусы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СпецПредложение</name>
      <comment>Комплект номенклатуры и бонусов</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСпецПредложения</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставНабора</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

CommonForms/абс_НазначениеАвтоматическихСкидок/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.АдресВХранилище);
	
	ПримененныеСкидки = СтруктураПараметров.ПримененныеСкидки;
	МассивСкидок = СтруктураПараметров.МассивСкидок;
	Контрагент = СтруктураПараметров.Контрагент;
	ДатаДок = СтруктураПараметров.ДатаДок;
	ЗаказСсылка = СтруктураПараметров.ЗаказСсылка;
	
	Если ЗначениеЗаполнено(ЗаказСсылка) Тогда
		ГраницаПроверкиУсловия = Новый Граница(ЗаказСсылка.МоментВремени(), ВидГраницы.Исключая);
	Иначе
		ГраницаПроверкиУсловия = Новый Граница(КонецДня(ДатаДок), ВидГраницы.Включая);
	КонецЕсли;
	
	ТаблицаСкидок = ИнформацияОРасчетеСкидокПоДокументуВЦелом.Выгрузить();
	
	Для каждого Скидка из МассивСкидок Цикл
		
		НоваяСтрока = ТаблицаСкидок.Добавить();
		
		НоваяСтрока.Значение = абс_Дистрибуция.ПолучитьИмяСкидки(Скидка);
		
		СтрокаПримененнаяСкидка = ПримененныеСкидки.Найти(Скидка, "Скидка");
		Если Не СтрокаПримененнаяСкидка = Неопределено Тогда
			НоваяСтрока.Комментарий = СтрокаПримененнаяСкидка.Комментарий;
		КонецЕсли;
		
		НоваяСтрока.Управляемая = Скидка.абс_НазначаетсяВручную;
		
		Если Скидка.Условие = Перечисления.УсловияСкидкиНаценки.абс_ПроцентомСОграничением Тогда
			 НоваяСтрока.УсловияВыполнены = абс_Дистрибуция.ПроверитьВыполнениеУсловияСкидки(Скидка, ЗаказСсылка);
		Иначе
			НоваяСтрока.УсловияВыполнены = Истина;
		КонецЕсли;
		
		//+Лео Сафонов ЕА Лимит по скидкам
		//Если НЕ ПроверитьОграничениеПоСкидке(Скидка,ЗаказСсылка) Тогда
		//	НоваяСтрока.УсловияВыполнены = Ложь;	
		//КонецЕсли;	
        //-Лео Сафонов ЕА Лимит по скидкам
		
		Если Скидка.абс_НазначаетсяВручную Тогда
			НоваяСтрока.НазначенаПользователем = Не СтрокаПримененнаяСкидка = Неопределено;
		Иначе
			НоваяСтрока.НазначенаПользователем = НоваяСтрока.УсловияВыполнены;
		КонецЕсли;
		
		НоваяСтрока.ДокументСкидки = Скидка;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТаблицаСкидок, "ИнформацияОРасчетеСкидокПоДокументуВЦелом");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Закрыть(ПолучитьАдресВХранилище());
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервере
Функция ПолучитьАдресВХранилище()
	
	УправляемыеСкидки = Новый ТаблицаЗначений;
	УправляемыеСкидки.Колонки.Добавить("Скидка");
	УправляемыеСкидки.Колонки.Добавить("Комментарий");	
	                     
	ТаблицаСкидок = РеквизитФормыВЗначение("ИнформацияОРасчетеСкидокПоДокументуВЦелом");
	НайденныеСтроки = ТаблицаСкидок.НайтиСтроки(Новый Структура("НазначенаПользователем", Истина));
	
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НоваяСтрока = УправляемыеСкидки.Добавить();
		НоваяСтрока.Скидка = НайденнаяСтрока.ДокументСкидки;
		НоваяСтрока.Комментарий = НайденнаяСтрока.Комментарий;
	КонецЦикла;
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(УправляемыеСкидки, Новый УникальныйИдентификатор);
	
	Возврат АдресВХранилище;
	
КонецФункции

//+Лео Сафонов ЕА  Лимит по скидкам
&НаСервере
Функция ПроверитьОграничениеПоСкидке(СсылкаСкидка,ЗаказСсылка)
    ЛимитыНеИсчерпаны = Истина;
	УсловияВыполнены = Истина;

	ТекстСообщения = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаСкидокНоменклатурыТовары.Ссылка,
		|	УстановкаСкидокНоменклатурыТовары.Номенклатура,
		|	УстановкаСкидокНоменклатурыТовары.Лео_ЛимитШтук КАК ЛимитШтук,
		|	УстановкаСкидокНоменклатурыТовары.Лео_ЛимитСумма КАК ЛимитСумма,
		|	ВЫБОР
		|		КОГДА УстановкаСкидокНоменклатурыТовары.Лео_ЛимитШтук > 0
		|			ТОГДА ВЫБОР
		|					КОГДА УстановкаСкидокНоменклатурыТовары.Лео_ЛимитШтук >= ЕСТЬNULL(Лео_СкидкиОбороты.КоличествоОборот, 0)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЛимитПоКоличествуНеПривышен,
		|	ВЫБОР
		|		КОГДА УстановкаСкидокНоменклатурыТовары.Лео_ЛимитСумма > 0
		|			ТОГДА ВЫБОР
		|					КОГДА УстановкаСкидокНоменклатурыТовары.Лео_ЛимитСумма >= ЕСТЬNULL(Лео_СкидкиОбороты.СуммаСкидкиОборот, 0)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЛимитПоСуммеНеПривышен,
		|	 ЕСТЬNULL(Лео_СкидкиОбороты.СуммаСкидкиОборот,0) КАК СуммаОборот,
		|	 ЕСТЬNULL(Лео_СкидкиОбороты.КоличествоОборот,0) КАК КоличествоОборот
		|ИЗ
		|	Документ.УстановкаСкидокНоменклатуры.Товары КАК УстановкаСкидокНоменклатурыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Лео_Скидки.Обороты(, , , ДокументСкидки <> &ДокументСкидки) КАК Лео_СкидкиОбороты
		|		ПО УстановкаСкидокНоменклатурыТовары.Номенклатура = Лео_СкидкиОбороты.Номенклатура
		|			И УстановкаСкидокНоменклатурыТовары.Ссылка = Лео_СкидкиОбороты.Скидка
		|ГДЕ
		|	УстановкаСкидокНоменклатурыТовары.Ссылка = &Скидка";

	Запрос.УстановитьПараметр("Скидка", СсылкаСкидка);
   	Запрос.УстановитьПараметр("ДокументСкидки",ЗаказСсылка);
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ЛимитПоКоличествуНеПривышен И ВыборкаДетальныеЗаписи.ЛимитПоСуммеНеПривышен Тогда
			//ЛимитыНеИсчерпаны  = Истина;
			
		Иначе
			ЛимитыНеИсчерпаны  = Ложь;
			ТекстСообщения = ?(ВыборкаДетальныеЗаписи.ЛимитПоКоличествуНеПривышен,"", " превышение лимита на " + Строка(ВыборкаДетальныеЗаписи.ЛимитШтук-ВыборкаДетальныеЗаписи.КоличествоОборот) + " " + ВыборкаДетальныеЗаписи.Номенклатура.ЕдиницаХраненияОстатков.Наименование + Символы.ПС);
			ТекстСообщения = ТекстСообщения + ?(ВыборкаДетальныеЗаписи.ЛимитПоСуммеНеПривышен,"", ?(ЗначениеЗаполнено(ТекстСообщения), ",","")+ " превышение лимита на " + Строка(ВыборкаДетальныеЗаписи.ЛимитСумма-ВыборкаДетальныеЗаписи.СуммаОборот) + " руб.");
			Сообщить("Артикул " + ВыборкаДетальныеЗаписи.Номенклатура.Артикул + ":" + ТекстСообщения);
		КонецЕсли;
	КонецЦикла;

	Возврат ЛимитыНеИсчерпаны;
КонецФункции
//-Лео Сафонов ЕА   Лимит по скидкам
